阿里地区
恩平县
左贡县
来阳市
竹溪县
淇县
丹阳市
雷山县
青铜峡市
大余县
泰宁县
台安县
东胜区
岗巴县
北宁市
布尔津县
郏县
沙坡头区
东西湖区
红旗区
龙马潭区
讷河市
荣县
南朝鲜
思明区
宣武区
措美县
济源市
建湖县
常熟县
四平市
旅顺口区
延庆县
达州市
太平区
冀县
宽城区
迎江区
合川区
云和县
宁冈县
平果县
桑植县
站前区
方城县
开元区
新罗区
获鹿县
缅甸
叙永县
清河区
裕安区
双江拉祜族佤族布朗族傣族自治县
伯利兹
沾益县
北塔区
依兰县
沿滩区
孝感县
黄山市
鹤峰县
宽城满族自治县
兴山县
永红区
林芝地区
柳南区
北区
龙宝区
漯河市
商州市
银川市
崆峒区
横峰县
怀来县
梵蒂冈
汾西县
蓝田县
龙州县
奉化市
连山壮族瑶族自治县
盐都区
临泽县
贺州市
海拉尔区
普安县
稻城县
沧县
冷水江市
昭通县
鲁甸县
德安县
图们市
海拉尔市
通辽县
龙港区
满洲里市
延吉市
敦化县
福建省
涡阳县
吐鲁番地区
横县
阜南县
三穗县
绥中县
桓仁满族自治县
乌拉特后旗
阳原县
紫云苗族布依族自治县
石门县
四褐山区
高密市
永吉县
潮阳市
沧浪区
吴凇区
临沂市
灵璧县
广德县
彭阳县
云城区
费县
兴和县
江海区
市北区
尉氏县
应城县
甘孜藏族自治州
田阳县
安远县
大冶县
丰宁满族自治县
辉县市
大宁县
平度县
井陉矿区
启东市
右玉县
江阳区
友谊县
宾县
寒亭区
赫章县
双城县
仙桃市
即墨市
乐清市
宜丰县
金湾区
宁都县
南陵县
建平县
叠彩区
陕西省
达拉特旗
宜都县
竹山县
浦江县
朗县
闵行区
昌吉回族自治州
几内亚
原阳县
根河市
博兴县
云霄县
洛扎县
青县
黑水县
南涧彝族自治县
栾川县
额济纳旗
浦口区
贞丰县
周口市
八步区
林州市
宝山县
丹凤县
丰镇县
张湾区
池州地区
海盐县
沈北新区
尚义县
红河县
叶县
宜阳县
洛南县
意大利
江北区
宁化县
静安区
路南区
铁力县
新疆维吾尔自治区
怀宁县
昌邑市
丰镇市
莱阳市
綦江县
崇州市
裕诶口区
金昌市
临汝县
新汶县
当雄县
泰山区
杨凌区
扬州市
上虞市
易县
武汉市
延边朝鲜族自治州
西乌珠穆沁旗
靖江县
江华瑶族自治县
田林县
陇南市
乐业县
临汾市
含山县
禄丰县
定州市
宣州市
循化撒拉族自治县
孟连傣族拉祜族佤族自治县
铜鼓县
宿迁市
宁国市
阿合奇县
霍山县
连平县
馆陶县
雁塔区
雨花台区
峡江县
滑县
玉溪县
坊子区
青龙县
沙洋区
米脂县
称多县
岳池县
大通区
宁夏回族自治区
大成县
河津市
武邑县
汤旺河区
宜州市
白水县
道外区
莲花县
法属玻利尼西亚
兴安区
侯马市
阿尔巴尼亚
黄山区
琼中黎族苗族自治县
揭东县
晋宁县
汤原县
廛河回族区
柳林县
巩县
美溪区
长丰县
凤庆县
若尔盖县
农安县
建邺区
广南县
新安县
山亭区
沈丘县
井岗山县
黔江县
谯城区
万荣县
零陵县
哈密县
长沙市
果洛藏族自治州
太白县
通县
新津县
厄瓜多尔
新郑市
乾安县
海陵区
师宗县
新区
昌江区
镜湖区
木兰县
粱山县
永新区
越秀区
武清区
漠河县
冷水滩市
商丘市
阎良区
茂港区
正定县
铜陵县
门源回族自治县
玉泉区
衡阳市
鸳江区
巴巴多斯
略阳县
秀洲区
固始县
诸暨市
盖州市
衢州市
崖县
永城市
汾阳市
共和县
江干区
黄冈市
阿城县
九台县
马哈巴
三明市
前进区
郾城县
兴平县
乌苏市
东港市
东明县
泾源县
平乐县
临潼县
天祝藏族自治县
武强县
黔阳县
金坛县
无锡市
英德市
福贡县
冷水滩区
玉树县
索马里
金山屯区
宁洱哈尼族彝族自治县
通道侗族自治县
宛城区
建昌县
金门县
巫溪县
浈江区
中山区
柳河县
正宁县
云浮市
张家口市
磐安县
壶关县
紫阳县
那曲地区
佳县
大姚县
枣强县
古田县
梅州市
定远县
金川县
濉溪县
新阿图什县
巴拉圭
洪湖市
湖南省
开平县
金城江区
凯里市
邵武市
太子河区
西山区
西市区
潮南区
可可基林群岛
新建县
尤溪县
沙雅县
海伦市
海兴县
京山县
鄂伦春自治旗
阜康市
金园区
桦甸市
济宁市
孝昌县
襄樊市市辖区
西丰县
沂南县
乐平县
黎城县
梁子湖区
桃源县
玛沁县
玉林县
万县市
西林区
黄平县
五常县
资兴市
蒙山县
孝南区
双鸭山市
三门县
太平县
赤峰市
威海市
阿拉善右旗
楚雄彝族自治州
美属太平洋群岛
东乡县
永靖县
米东区
合川市
黄县
兰西县
忠县
高要市
丰南区
溪湖区
霍邱县
浮梁县
梅河口市
爱辉区
燕山区
巴林右旗
长垣县
静海县
罗源县
乌苏县
鄂城区
赣县
杏花岭区
蒙古
方正县
彭山县
九龙县
城口县
永城县
平南县
邕宁县
贡山独龙族怒族自治县
遂宁县
临湘县
襄樊市襄城区
莎车县
中山县
凯里县
阳明区
桐庐县
浑源县
恒山区
罗甸县
仁布县
东风区
三水市
驿城区
封开县
卫东区
伊宁市
淮安市
枞阳县
复县
东昌府区
武功县
碧土县
东胜市
绥化市
萨迦县
遵化县
长清区
彝良县
澄海区
元宝山区
同德县
虎丘区
息县
安丘县
明山区
沙湾县
池州市
怀柔区
滦南县
咸宁市
神农架林区
科尔沁区
长春市
石首市
新城子区
广河县
梅列区
圣多美和普林西比
峨眉山市
红岗区
乌鲁木齐县
武都县
襄汾县
方山县
新泰县
信宜县
藤县
湘乡市
阳谷县
桂阳县
汝阳县
瑞丽县
随县
广东省
通许县
广丰县
长汀县
英属印度洋领土
临清市
介休县
红桥区
龙海县
老挝
哈密市
同平区
突尼斯
襄樊市樊东区
喀麦隆
甘南藏族自治州
阿尔山市
弓长岭区
广化区
佛冈县
惠农县
南通市
蓬莱市
虎林县
金寨县
防城港市港口区
卢森堡
通河县
岱岳区
青阳县
华容县
逊克县
龙湾区
芝罘区
封丘县
景县
商水县
祁县
龙门县
南木林县
旌阳区
呼玛县
江西省
宁德县
嘉禾县
台东区
琼山市
岚山区
黎川县
兴化市
云安县
河池市
萧山区
德都县
大兴区
嘉峪关市
八宿县
花溪区
千阳县
永登县
巴楚县
宁海县
魏县
敦化市
相山区
荣昌县
商县
太和区
平顶山市
新化县
丽江市
介休市
临武县
新蔡县
荷塘区
华龙区
昔阳县
富平县
茶坊区
隆子县
江都县
正镶白旗
周至县
黔江区
南充县
德昌县
海北藏族自治州
湘桥区
马提尼克
茄子河区
鄢陵县
乌鲁木齐市
五桥区
太仆寺旗
东川区
萧县
新密区
庞家堡区
洪泽县
乡宁县
广汉县
句容市
南召县
太和县
文山县
肥城市
密云县
福山区
福泉县
临洮县
寿光县
靖江市
润州区
东光县
黑山县
墨竹工卡县
高安市
汲县
西和县
托克逊县
昂昂溪区
碧江县
巫山县
铜官山区
栖霞市
屯溪区
冕宁县
密山市
东台市
营山县
潮阳区
雨山区
班戈县
阳江县
灵武市
徐水县
桃城区
红古区
工布江达县
爱尔兰
新林区
嘉兴市
大通回族土族自治县
昭阳区
三河县
阿巴嘎旗
哈尔滨市
博尔塔拉蒙古自治州
淮北市
宁乡县
阿巴哈纳尔旗
灌云县
托克劳
武定县
文成县
永丰县
西峰区
丹棱县
鲤城区
中沙群岛的岛礁及其海域
宿豫县
白银区
金秀瑶族自治县
连南瑶族自治县
饶河县
遵义县
深圳市
西双版纳傣族自治州
漳平县
剑阁县
罗湖区
晋中市
绍兴市
澳地利
龙安区
扶绥县
源汇区
夏河县
襄垣县
穆棱市
登封县
开封县
湖口县
繁峙县
麻章区
岭西区
同心县
芦淞区
定结县
牙克石市
潘集区
浉河区
铜山县
泾县
宜兴县
中卫市
龙山区
张北市
北川县
从江县
南澳县
闻喜县
永寿县
临湘市
山阳县
富县
瑞典
娄烦县
潞城市
崇义县
壤塘县
集美区
白云矿区
万柏林区
阳春县
绥阳县
扎囊县
青浦县
西乡塘区
孟加拉
卓尼县
无为县
昌邑区
安宁市
马里
渝中区
绥化县
芳村区
延津县
陵水黎族自治县
津市市
三亚市市辖区
名山县
江津县
无锡县
新喀里多尼亚
讷河县
锡林浩特市
万全县
交口县
马来西亚
米泉市
沅江县
约斡斯顿岛
和龙县
漳县
城区
洛浦县
天水县
宣化县
乌海市乌达区
西夏区
德庆县
城固县
云阳县
印度尼西亚
酒泉市
利津县
伊朗
毕节地区
怀集县
卢氏县
同安区
花县
李沧区
呼兰县
锦西县
神木县
麻城县
点军区
惠东县
永胜县
板塘区
达川市
山阴县
慈溪市
积石山保安族东乡族撒拉族自治县
赤城县
万山特区
巨野县
福鼎县
咸阳市
陈仓区
桑日县
长寿区
土耳其
刚果
大理市
茂名市市辖区
塔城地区
凤泉区
集宁区
宝清县
颍泉区
安达市
日喀则县
广安区
隆尧县
印台区
东兴市
河曲县
丽江纳西族自治县
长子县
黎平县
新余县
长武县
兰州市
龙海市
老河口市
白山市
金山县
瑞安市
武隆县
左云县
交城县
金昌市金川区
开原县
塔城市
宁波市
宜昌市
休宁县
海南省
爱民区
锡山区
大安市
南坪县
六盘水市
建华区
许昌县
马塘区
市南区
清江市
绥滨县
鸡东县
平谷区
腾冲县
港口区
罗江县
邙山区
科威特
苍梧县
城厢区
中阳县
鄂尔多斯市
察哈尔右翼前旗
民乐县
怒江傈僳族自治州
拜泉县
寿阳县
钟山区
灵宝市
瑞金市
大兴安岭地区
湘潭县
带岭区
乳山县
平泉县
青秀区
清江县
惠民县
南明区
巨鹿县
宁武县
加格达奇区
土默特左旗
灵寿县
资中县
施秉县
安居区
泰和县
乐都县
山城区
兴县
安新县
省滦县
睢宁县
乌达区
西工区
衡山县
柳城县
戚墅堰区
蔡甸区
牡丹江市
秀山县
建德市
莱州市
哲里木盟
港北区
宣恩县
额敏县
大安区
黔西县
临川市
荆州市
府谷县
清徐县
商河县
林西县
乌克兰
榆林市
昭觉县
南乐县
蒲江县
卫辉市
舒城县
全椒县
捷克斯洛伐克
武鸣县
澄海市
保亭黎族苗族自治县
吉木乃县
巧家县
原平市
锦县
牡丹区
南充市
安县
如皋市
西区
余姚市
乌审旗
新城区
任丘市
康平县
莱西县
边坝县
胶县
广平县
龙子湖区
扎鲁特旗
忻州市
潞西市
梅县市
浦北县
萨嘎县
凭祥市
新浦区
白云区
精河县
金砂区
龙潭区
邢台县
都匀市
雄县
轮台县
清河县
民丰县
故城县
潢川县
嘴山市
嘉陵区
陶乐县
叙利亚
南岳区
磁县
营口县
资溪县
沙洲县
班玛县
通化市
大邑县
路桥区
昌江黎族自治县
耒阳县
乌干达
旬阳县
东河区
咸丰县
普洱哈尼族彝族自治县
加蓬
福清市
福田区
东源县
广济县
铁东区
鸡冠区
江孜县
库尔勒市
虎林市
太仓县
榆中县
松滋县
固阳县
猇亭区
津南区
甘井子区
武都区
澳大利亚
仁怀县
法库县
水城县
细河区
民主也门
诏安县
织金县
丽水市
南宫县
呼和浩特市
榆林县
庐山区
邢台市
通渭县
裕华区
马关县
肃北蒙古族自治县
靖边县
集安市
营口市
南市区
溆浦县
建始县
房山县
麒麟区
武陟县
化德县
石阡县
喜德县
尧都区
葫芦岛区
宝安区
乐东黎族自治县
柳北区
滁县
晋安区
邳州市
随州市
海林县
高邮县
布拖县
高坪区
松溪县
西班牙
富蕴县
墨玉县
曲周县
三亚市
台前县
眉山县
瓮安县
聂荣县
吴川县
石嘴山市
宁安县
盐边县
新干县
龙井县
临沭县
彭州市
茅箭区
任丘县
喀喇沁旗
高明市
上街区
朔城区
龙岩市
桐柏县
都兰县
文昌县
海丰县
曲阳县
北郊区
晴隆县
应城市
思茅市
英属维尔京群岛
成都市
崇安区
佛山市
镇康县
京口区
温江县
徐闻县
韶山市
离石市
阿克苏地区
定边县
莲都区
崇安县
汉南区
晋城市郊区
平坝县
万源市
策勒县
元坝区
长岛县
昌宁县
惠阳市
武山县
将乐县
荆门市
嘉定县
伊春区
山东省
涞源县
颍上县
朝阳县
青河县
吴江市
安源区
靖州苗族侗族自治县
南宫市
沙特阿拉伯
文县
平川区
洞口县
铜仁县
镇巴县
玻利维亚
勃利县
尼玛县
常州市
南城县
九寨沟县
大关县
乌兰浩特市
准格尔旗
偏关县
西峰市
绥江县
霞山区
内乡县
毕节县
德令哈市
西安市
小店区
邵东县
云浮县
土默特右旗
婺源县
翁牛特旗
分宜县
江油县
晋城市市辖区
临川县
芜湖市
凌海市
乌海市市辖区
黟县
安岭四区加格达奇区松岭区新林区呼中区
濮阳市
监利县
磴口县
江苏省
苏尼特左旗
洛隆县
五原县
启东县
崂山县
游仙区
双塔区
和平区
常熟市
会昌县
卡诺尔
集安县
平乡县
蒸湘区
陵县
红星区
伊春市
米林县
南县
仙游县
南芬区
长兴县
新加坡
旬邑县
饶阳县
常山县
宜山县
凤冈县
特克斯县
百色县
襄阳区
兴城市
浑江市
华坪县
宜宾县
怀化县
承德市
武安县
邹城市
枝城市
新北区
北海市
黔南布依族苗族自治州
嘉善县
洛阳市
圣皮埃尔和密克隆
丹巴县
海城市
东兴区
丹阳县
瓦努阿图
清水县
韶关市
城中区
港闸区
长安区
顺平县
遂平县
长治市
潍县
大田县
金州区
密山县
明光市
七台河市
甬桥区
子洲县
曾都区
合山市
中方县
瀍河回族区
万州区
唐县
定陶县
梨树区
冈比亚
南岔区
路北区
静乐县
吴忠县
白下区
义乌市
新丰县
富锦县
东阳市
顺义县
龙沙区
锦西市
新富蕴县
西华县
云龙县
霞浦县
琅琊区
澧县
岳阳楼区
周村区
大庸县
海晏县
林县
镇宁布依族苗族自治县
鹤城区
沙头角区
阿坝县
乍得
辰溪县
井陉县
四会市
通辽市
嵩明县
木垒哈萨克自治县
鄂城县
曲麻莱县
堆龙德庆县
德兴市
光华县
南长区
和县
宁强县
丘县
石鼓区
惠济区
滨江区
应县
高邑县
北关区
革吉县
河浦区
大城县
东辽县
吉利区
靖远县
定日县
芙蓉区
海南区
嘉黎县
翔安区
内呼和浩特市
盐亭县
崇川区
吉布提
石拐区
清新县
抚顺市
当阳市
吉隆县
柯城区
伊犁哈萨克自治州
振兴区
峨眉县
舟山市
灯塔市
路南彝族自治县
马拉维
列支敦士登
古浪县
白碱滩区
阜城县
涪陵市
贾汪区
贵港市港南区
百色市
长乐县
江阴县
阿曼
清浦区
鹿城区
天镇县
硚口区
川汇区
安庆市
瓜德罗普
宁阳县
芗城区
兴安县
富裕县
长乐市
蛟河市
长安县
伊金霍洛旗
钦州县
上栗县
三原县
西城区
德清县
镇赉县
乐东县
电白县
房县
红河哈尼族彝族自治州
康保县
潮州市
武宣县
陇西县
大连市
鄂托克前旗
桦甸县
闽清县
鸠江区
北辰区
彭泽县
垫江县
桦南县
句容县
石狮市
波密县
河南省
界首县
鹅湖区
怀柔县
盘龙区
利辛县
沁水县
阜阳地区
理塘县
尖扎县
博乐县
临夏县
会理县
山南地区
美属萨摩亚
银海区
圣文森特和格林纳斯丁
岑溪县
和田市
玉树藏族自治州
武冈县
莱城区
迁安县
以色列
清流县
墨江哈尼族自治县
芬兰
嘉祥县
筠连县
泸溪县
洮南市
雷州市
东海县
开曼群岛
胶南县
盐山县
阳山县
秭归县
铁法市
防城县
埃塞俄比亚
什邡县
希腊
广安市
秦淮区
商州区
越南
东沟县
蠡县
温泉县
甘泉县
沭阳县
文山壮族苗族自治州
蓟县
芝山区
西青区
岳塘区
武川县
榆社县
防城港市
思茅区
商南县
汝南县
枣阳县
绿园区
扶余市
临河县
临夏市
文安县
秀峰区
株洲县
亳县
永川县
商城县
富民县
双清区
万安县
丰县
邓县
南平市
疏附县
慈溪县
沂水县
大埔县
雨花区
廊坊市
朔州市
黄南藏族自治州
巴县
歙县
四方区
岑巩县
庄浪县
黄岩区
施甸县
什邡市
海门县
清镇市
下花园区
黄埔区
新乡市
连州市
元宝区
北戴河区
鹤山县
会同县
睢县
塔什库尔干塔吉克自治县
襄樊市
环江毛南族自治县
安吉县
宝山区
丹徒县
惠山区
尉犁县
岑溪市
德宏傣族景颇族自治州
长洲区
若羌县
洱源县
湛河区
泸定县
贵池区
马山区
平利县
南川市
德阳县
龙华区
哈巴河县
成县
通化县
永安县
南昌市
滨湖区
互助土族自治县
甘孜县
广西壮族自治区
黄陂区
皇姑区
独山子区
临城县
龙湖区
马尔代夫
孟州市
克东县
桦川县
溧水县
肇东县
巢县
锦屏县
围场满族蒙古族自治县
湘潭市
湘江区
桂平县
平山县
中宁县
易门县
贺兰县
淅川县
历城区
景东彝族自治县
洪雅县
青铜峡县
中甸县
黄岛区
德城区
多伦县
拉孜县
香格里拉县
江北县
乐陵市
安定区
内江市
遵化市
牟定县
平江县
祁阳县
改则县
阿勒泰市
天宁区
河口瑶族自治县
江津市
乌当区
喀什市
南岗区
信州区
鼎湖区
伊通满族自治县
金川区
聊城市
万宁县
五通桥区
伊吾县
龙泉市
固安县
铁力市
滨城区
忻县
莱阳县
色达县
桐城市
格陵兰
永州市
库伦旗
川沙县
高淳县
万年县
安乡县
博爱县
淮南市
南康市
端州区
孟县
高陵县
宁远县
光泽县
万盛区
遵义市市辖区
独山县
杜集区
金堂县
塞内加尔
巴东县
台儿庄区
澜沧拉祜族自治县
盐城市
郸城县
秘鲁
察布查尔锡伯自治县
开远市
阳信县
张北县
越城区
邗江区
雁江区
抚松县
太湖县
滕县
赣州市
泗水县
宣威市
来安县
扶风县
凌源县
南海县
武陵区
盐源县
运城市
哈密地区
不丹
平遥县
江津区
离石县
乌兰察布盟
台江区
临安市
彬县
嵊州市
石峰区
滁州市
泗阳县
铁锋区
华阴县
祁门县
商丘县
永康市
禹会区
麻山区
南雄县
新洲县
米泉县
金华市
连山区
娄底市
迁西县
隆化县
华容区
兴隆县
市荔湾区
谢家集区
和田县
马尔康县
望城县
海曙区
海口市
宝塔区
即墨县
乌拉圭
汉阳区
华亭县
临猗县
宜春市
新市区
自流井区
甘德县
扎赉特旗
乐山市
寿县
环翠区
榕城区
乐至县
房山区
顺昌县
沧州市
焦作市
印江土家族苗族自治县
庆阳市
富川瑶族自治县
建瓯市
青海省
鄂温克族自治旗
开阳县
伍家岗区
屏南县
衡南县
海伦县
禅城区
岳西县
利比亚
乌拉特前旗
浚县
阳高县
榆次市
保德县
兴宁市
铜仁地区
保山县
桐乡市
屏边苗族自治县
泽州县
揭阳县
巴州区
双峰县
宁国县
阜平县
关岛
溧阳县
新西兰
峰峰矿区
深州市
松原市
内鄂温克族自治旗
天长县
罗城仫佬族自治县
德州市
永和县
昂仁县
莱芜县
塔城县
黎巴嫩
冰岛
琼海市
古交市
宜君县
东陵区
荆门县
灵川县
大方县
新泰市
孙吴县
九江市
潜江县
黔东南苗族侗族自治州
淄博市
富阳市
汪清县
西林县
包河区
郧县
永年县
湘东区
华池县
成安县
陆丰县
牛庄区
宁河县
怀化市
南城区
道真仡佬族苗族自治县
泰国
呼兰区
玉环县
乳山市
新民县
鸡泽县
五常市
建水县
沈阳市
西岗区
华阴市
马达加斯加
兴文县
措勤县
札达县
梧州市
沁源县
巴林左旗
河源县
红山区
桓台县
湄潭县
四方台区
星子县
铁法区
黄州市
嵩县
五台县
松阳县
让胡路区
肃州区
固原县
涟沅县
蚌埠市
海康县
涞水县
惠城区
苍溪县
昌江县
斯里兰卡
三山区
十堰市
西畴县
阿尔及利亚
茂名市茂南区
四川省
贡井区
务川仡佬族苗族自治县
瑶海区
香河县
长海县
宝坻区
海阳市
曲沃县
邗江县
微山县
渠县
天长市
庆云县
泽库县
平江区
彰武县
镇安县
北票市
泊头市
解放区
万宁市
本溪市
丛台区
风山县
大厂回族自治县
秀屿区
潜山县
乳源瑶族自治县
滦县
张家港市
利川县
金乡县
翠峦区
尚志县
注根据中发号文及其它相关规定大兴
庐阳区
仁怀市
沙洋县
巴彦淖尔盟
灌县
阳春市
慈利县
郾城区
渭源县
太平洋群岛
黄州区
新会县
北流县
杭锦旗
克孜勒苏柯尔克孜自治州
天台县
金沙县
张掖市
巴林
江浦县
石泉县
清郊区
高邮市
永修县
河间市
雁峰区
湟源县
惠州市
久治县
立山区
藁城市
汉源县
攀枝花市
桥东区
日照县
思南县
石楼县
通州区
夏邑县
东方市
大理县
景谷傣族彝族自治县
咸安区
隆林各族自治县
鹰潭市
科尔沁右翼中旗
浏阳市
南川县
昆明市
妥坝县
望谟县
安康市
柳江县
城阳区
甘南县
蓬安县
岳普湖县
赤水县
石棉县
城步苗族自治县
炎陵县
南雄市
勐海县
古塔区
佛坪县
贵定县
临沧县
南阳县
夏津县
鹤山区
泌阳县
新金县
毛里求斯
揭阳市
合江县
下陆区
匈牙利
吉林市
茂县
岳阳县
宝应县
资源县
永川区
左权县
北安县
西安区
户县
下关区
南山矿区
章贡区
新巴尔虎左旗
定西县
东丽区
赤壁市
龙川县
六安地区
曲江县
凤县
合川县
北站区
海勃湾区
动力区
武夷山市
潜江市
东湖区
岭东区
辉南县
苏州市
巴拿马
坎顿和恩德贝里群岛
甘洛县
威宁彝族回族苗族自治县
沙坪坝区
水磨沟区
库车县
龙凤区
武昌县
辉县
东宁县
泗县
高明区
连云区
相城区
贵阳市
阿荣旗
本溪满族自治县
郊区
赫德岛
涉县
新昌县
丹江口市
宁城县
醴陵县
河间县
奉新县
庆阳县
洪都拉斯
克什克腾旗
市中区
闽侯县
尼加拉瓜
从化县
宿州市
柞水县
白俄罗斯
苏联
九里区
潞城县
丹寨县
代县
重庆市
鄱阳县
临西县
江都市
渝水区
威信县
宝鸡县
丰顺县
怀仁县
大庸市
穆棱县
丘北县
高县
吉林省
全南县
枝江县
德兴县
汶川县
谷城县
澳门
邵武县
掇刀区
城东区
景洪县
管城回族区
美国
留尼汪
兰考县
安化县
林甸县
邯郸县
安义县
酒泉县
凉州区
阳朔县
巴里坤哈萨克自治县
尼勒克县
化州市
松滋市
塞拉利昂
牟平区
湟中县
石河子市
宣化区
非国家标准行政区划只宜作为统计汇总用地址代码
夹江县
荔波县
蚌山区
满城县
海州区
通海县
罗山县
江达县
高唐县
彭县
瓯海区
钢城区
东安区
开平市
吴县
古城区
海沧区
余庆县
乾县
光山县
涿鹿县
新县
融安县
临泉县
兖州县
平阴县
崇明县
公主岭市
颍州区
南华县
东川市
江城区
莒县
莲湖区
永安市
无棣县
肇东市
和硕县
金湖县
工农区
靖安县
吉首市
通什市
凤凰县
顺德区
玉龙纳西族自治县
迎泽区
玉门市
南漳县
阿图什市
长白朝鲜族自治县
淮安县
霍林郭勒市
郴州市
普定县
南沙群岛
原平县
禄劝彝族苗族自治县
北湖区
如东县
瑞丽市
约旦
海安县
辽宁省
丰润区
乐陵县
危地马拉
嘉鱼县
二连浩特市
西峡县
武乡县
博野县
内石拐矿区
崇左市
二七区
天成区
扎襄县
海原县
荣城市
阿勒泰地区
法罗
龙山县
清苑县
镶黄旗
孝感市市辖区
青州市
临沧市
黄冈县
高密县
金阳县
桃山区
天峨县
铜梁县
卧龙区
城子河区
湘西土家族苗族自治州
北林区
洋县
河津县
当涂县
鹤壁市鹤山区
湾里区
科尔沁右翼前旗
金台区
象山县
青浦区
荥阳市
赤坎区
文昌市
沧口区
松江区
永仁县
兴国县
宜兴市
六合区
平度市
呼中区
墨脱县
晋州市
永昌县
新密市
澄海县
蒲县
乌伊岭区
北仑区
江口县
杭州市
新荣区
大东区
徐州市
泸水县
石灰窑区
丹东市
盐都县
阳城县
邓州市
汝城县
泉州市
图木舒克市
达县
狮子山区
普洱市
溧阳市
阿拉善左旗
宁津县
献县
容县
乌恰县
马边彝族自治县
望都县
葡萄牙
温岭市
新平彝族傣族自治县
谢通门县
定南县
灵石县
钦州市
郁南县
船营区
文水县
东昌区
开平区
玉田县
莫力达瓦达斡尔族自治旗
石柱土家族自治县
福克兰群岛马尔维纳斯
历下区
滕州市
文登县
赤道几内亚
露天区
荥经县
东洲区
安宁区
岚皋县
霸州市
江门市
禹州市
白沙黎族自治县
阿拉善盟
巩留县
珠晖区
清涧县
迪庆藏族自治州
西陵区
兴宁区
达孜县
多米尼加
禹城县
玉山县
平顺县
潼关县
古巴
修水县
巴中市
察雅县
金家庄区
薛城区
梁山县
日本
六安市
昭苏县
威远县
桂东县
凉山彝族自治州
榆树市
晋县
吴川市
吉县
鹰手营子矿区
集贤县
岳麓区
五家渠市
阜康县
项城县
兴山区
宜良县
仓山区
辽源市
沿河土家族自治县
万源县
马山县
平鲁区
博罗县
盈江县
北川羌族自治县
四会县
正安县
辽阳市
任县
宿城区
椒江区
政和县
金凤区
宿豫区
安溪县
东阿县
罗马尼亚
澄江县
三岔子区
新民市
尼木县
岷县
纳溪区
保定市
湖北省
天全县
文登市
法国
建瓯县
贵南县
凤阳县
富阳县
绥宁县
海阳县
濮阳县
邯郸市
新都区
平桥区
通州市
益阳县
禄劝县
沁县
新河县
张家川回族自治县
厦门市
镇坪县
延川县
新邱区
沐川县
高台县
泗洪县
扬中县
蔚县
合水县
东台县
碑林区
铅山县
保亭县
漳浦县
滴道区
荔湾区
新源县
王益区
玉林市
连云港市
常德市
永济县
禹王台区
大观区
武胜县
贵州省
龙文区
额尔古纳右旗
山海关区
西昌市
双台子区
陆川县
抚宁县
秦城区
美兰区
鸡西市
从化市
邻水县
丰城县
永川市
宝丰县
宽甸满族自治县
灵武县
金明区
凤城满族自治县
临漳县
汕尾市
齐齐哈尔市
囊谦县
尼泊尔
包头市
定西市
济源县
金山区
老边区
关岭布依族苗族自治县
于洪区
新野县
阿城区
安阳县
麻阳苗族自治县
凤城市
安岳县
那曲县
肃南裕固族自治县
清河门区
莒南县
邵阳市
昭平县
峄城区
扎伊尔
纳雍县
缙云县
顺庆区
平邑县
蕉城区
调兵山市
汤阴县
吉首县
临潭县
铁山港区
聊城县
定兴县
彭水苗族土家族自治县
坦桑尼亚
蒲城县
清远县
三门峡市
突泉县
固原市
翁源县
禹县
榆次县
涪陵区
永济市
昌吉县
伊拉克
凌河区
上城区
东至县
大丰市
经济开发区
长葛县
晋江市
团风县
钟山县
桂林市
丰南县
余干县
迭部县
射洪县
子长县
和布克赛尔蒙古自治县
青白江区
珙县
广饶县
淳安县
印度
咸宁县
墨西哥
临邑县
高明县
井冈山市
道里区
乡城县
宁德市
弥渡县
胶州市
南靖县
克山县
新城县
乐昌县
灯塔县
阳泉市
当阳县
临颖县
德钦县
东阳县
金县
隆昌县
泰顺县
鼎城区
双牌县
乌什县
双阳县
邹平县
萨尔瓦多
成武县
宁陵县
吕梁市
望奎县
项城市
青川县
密县
达濠区
顺河回族区
桐梓县
胶南市
乌兰察布市
河南蒙古族自治县
稷山县
宜川县
沾化县
玛纳斯县
泰兴县
德保县
屯昌县
百慕大
中站区
都匀县
新田县
梅里斯达斡尔族区
东营市
昆山县
周宁县
喀什地区
武义县
亳州市
舒兰县
富源县
康定县
老城区
象牙海岸
信阳市
山西省
颍东区
黄石港区
金安区
永福县
大安县
复兴区
内丘县
于都县
漳平市
巴布亚新几内亚
防城港市防城区
普宁市
儋州市
嘉峪关市市辖区
遵义市
东城区
上饶县
内东河区
阿瓦提县
诸城县
杨陵区
景宁畲族自治县
马村区
文圣区
麦盖提县
喜桂图旗
永平县
大冶市
新和县
江阴市
格尔木市
永新县
攸县
天门县
惠农区
江汉区
巴音郭楞蒙古自治州
霍州市
扶余县
高平县
普兰店市
乌海市海勃湾区
君山区
寿宁县
梁平县
新晃侗族自治县
伊宁县
东区
镇平县
深泽县
阳江市
昌都县
向阳区
贵德县
东坡区
天河区
大渡口区
贵溪市
平鲁县
思茅县
桂平市
乌海市海南区
垣曲县
离石区
上沃尔特
安国市
常宁县
朝天区
华蓥市
赞皇县
加拿大
济阳县
敖汉旗
汉阳县
大同市
八道江区
玛曲县
社旗县
武威县
化州县
蒙阴县
盐城县
资阳市
固镇县
新余市
镇雄县
阜宁县
蜀山区
阿拉伯联合酋长国
简阳县
霍城县
鹿寨县
西撒哈拉
公园区
东乡族自治县
秦州区
藁城县
芦溪县
苏尼特右旗
宝安县
牟平县
奉化县
灌南县
东胜县
浏阳县
绵竹县
上饶市
南江县
海西蒙古族藏族自治州
辛集市
卢龙县
金东区
珠山区
通川区
富锦市
鼓浪屿区
崇文区
太谷县
冠县
圣基茨尼维斯安圭拉
庆元县
长沙县
靖宇县
渡口市
肯尼亚
黄龙县
永顺县
临河区
芦山县
奇台县
小河区
九台市
灵山县
加纳
莱索托
兰溪市
城南区
金牛区
会东县
孝义县
沛县
四子王旗
界首市
南部县
南斯拉夫
珠海市
北江区
祁东县
容城县
开福区
龙游县
生达县
大悟县
中卫县
寻甸回族彝族自治县
平阳县
阜新蒙古族自治县
平罗县
覃塘区
古蔺县
阿根廷
崇左县
武威市
祥云县
理县
习水县
古交工矿区
南郊区
射阳县
衢江区
南汇县
平定县
砀山县
市辖区
申扎县
塔河县
圭亚那
淮滨县
郫县
天元区
沈河区
都安瑶族自治县
马耳它
呈贡县
九原区
沙河市
西平县
东莞县
祁连县
永德县
渭城区
顺义区
阜新市
广阳区
青山湖区
浮山县
图瓦卢
大洼县
琼海县
开原市
普兰县
夷陵区
进贤县
石林彝族自治县
晋江县
上海市
金口河区
湖州市
临翔区
莱西市
瑞昌县
达坂城区
沽源县
博乐市
同江市
维西傈僳族自治县
偃师县
阳西县
云县
广昌县
恩平市
龙泉驿区
白塔区
河北省
汉沽区
前郭尔罗斯蒙古族自治县
潍坊市
益都县
镇江市
甘州区
曲松县
蓝山县
仪征县
浔阳区
盘县
振东区
襄樊市樊西区
南极洲
潼南县
白沙县
升平区
新乡县
枣庄市
广州市
雁山区
阆中市
庄河市
五营区
麦积区
增城市
华县
诸城市
滨县
雷波县
畹町镇
内昆都伦区
福安市
翼城县
玉溪市
治多县
萝岗区
乐安县
安国县
掖县
樊城区
曹县
巴中县
高安县
南非
浙江省
盘山县
崇仁县
天柱县
嵊泗县
南票区
六合县
仪征市
洪山区
西萨摩亚
江油市
酃县
振安区
会宁县
行唐县
温江区
建阳市
桥头区
东山区
朝阳区
仙居县
铁西区
赣榆县
高州县
衡阳县
云南省
高青县
喀喇沁左翼蒙古族自治县
利通区
宿迁县
廉江县
宿县
裕民县
贵溪县
临桂县
三江侗族自治县
安陆县
衡水市
留坝县
青山区
舟曲县
秦皇岛市
霸县
邕宁区
蛟河县
汶上县
汉阴县
利比里亚
通江县
同江县
江陵区
赤水市
松潘县
深县
民权县
平和县
黄浦区
高鹤县
宜宾市
巴马瑶族自治县
门头沟区
耀县
汇川区
象山区
阿克陶县
大化瑶族自治县
杞县
湖滨区
惠阳区
新都县
黔西南布依族苗族自治州
新乐县
昌图县
舞钢区
台州市
海龙县
昆山市
漳州市
日喀则地区
怀安县
永泰县
兴隆台区
陆良县
沙河县
通城县
道县
石屏县
安陆市
沂源县
良庆区
盐津县
锦州市
温县
汨罗县
陆河县
瑞昌市
石柱县
延安市
兰坪白族普米族自治县
南溪县
陕县
安多县
蛟潭区
高阳县
来宾市
汉滨区
巍山彝族回族自治县
锡林郭勒盟
酉阳土家族苗族自治县
三河市
罗田县
西塞山区
合阳县
石首县
丰泽区
松山区
盐湖区
上栗区
淮上区
察隅县
宜城县
新海区
番禺区
垦利县
北京市
东营区
吴兴区
临颍县
梅县
辽阳县
陇县
台湾省
太原市
向山区
榕江县
博山区
奉贤县
玉州区
苍南县
兰山区
宾川县
景泰县
楚州区
斯威士兰
东方县
牧野区
苏家屯区
双阳区
章丘县
河源市
莱山区
盐池县
新洲区
海林市
平凉市
醴陵市
宣城市
纽埃岛
镇远县
花垣县
安宁县
兴宾区
台江县
未央区
弋阳县
顺城区
恩施土家族苗族自治州
澄城县
普陀区
福海县
凤山县
大同县
纳溪县
平房区
银州区
长顺县
肇庆市
吴江县
永善县
武进区
都江堰市
莆田县
景德镇市
塞浦路斯
新青区
亭湖区
丰满区
兴海县
槐荫区
汨罗市
阳东区
石龙区
荔蒲县
南通县
石家庄市
伊克昭盟
合作市
景洪市
蓬江区
淮阴市
保康县
黄陂县
西秀区
舞阳县
乌尔禾区
东兰县
沙依巴克区
兴平市
和平县
贺县
连江县
自贡市
兴城县
上甘岭区
延平区
张家界市
西宁市
永定县
新乐市
吉州区
马鞍山市
盱眙县
安阳市
疏勒县
中市区
威县
杨浦区
定县
松江县
贵港市
云岩区
蝶山区
耒阳市
陵水县
西乡县
南汇区
获嘉县
呼图壁县
寻乌县
渝北区
元氏县
大荔县
梨树县
安顺县
巴塘县
长葛市
海宁县
平凉县
高港区
蒲圻县
双辽市
宿县地区
肥东县
泉山区
烟台市
泽普县
斐经
旌德县
偃师市
翠屏区
畹町市
天心区
潮安县
始兴县
瓦房店市
庆城县
抚州市
金昌市市辖区
昌黎县
防城区
罗庄区
圣赫勒拿
秀山土家族苗族自治县
三水区
新沂县
大港区
广元市
斗门区
莫桑比克
南浔区
兴宁县
汕头市
宝兴县
耿马傣族佤族自治县
肥西县
江川县
临高县
凤翔县
海淀区
中山市
临河市
肃宁县
江夏区
彭水县
新宾满族自治县
兴仁县
埃及
达尔罕茂明安联合旗
昌吉市
新会市
柘荣县
二道区
福州市
自治区直辖县级行政单位
台山市
黄骅市
安塞县
邱县
柘城县
繁昌县
兖州市
北票县
于田县
怀德县
盘县特区
晋城市城区
阜阳县
惠来县
罗定市
余杭区
城西区
诺富克岛
东山县
济南市
炉霍县
钦北区
平潭县
阿拉尔市
委内瑞拉
绛县
隆回县
台山县
纳米比亚
贡觉县
河池县
英德县
察哈尔右翼中旗
禹城市
淇滨区
北镇市
柯坪县
吉安市
灵宝县
临朐县
盐井县
钟楼区
遵义市红花岗区
勉县
凤台县
张掖县
福山县
莘县
回民区
栖霞区
平陆县
遂川县
南开区
孟村回族自治县
比利时
毛里塔尼亚
铜陵市
宝坻县
哥伦比亚
赤峰县
鹤庆县
大兴县
宁明县
昌邑县
佳木斯市
浦城县
乐亭县
保山市
汉川市
武冈市
永定区
和龙市
连城县
内江市东兴区
红花岗区
宾阳县
孝感市孝南区
丰都县
金溪县
新宁县
鹿邑县
富拉尔基区
清镇县
邵阳县
钦南区
石景山区
敦煌县
乃东县
利川市
南谯区
融水苗族自治县
顺德市
勐腊县
沙河口区
唐海县
东市区
揭西县
确山县
泸县
绵竹市
松桃苗族自治县
番禺市
舒兰市
省直辖县级行政单位
合肥市
北城区
崇礼县
六安县
安哥拉
同安县
嘉山县
额尔古纳左旗
滨州市
高要县
南沙区
崇阳县
黄梅县
温宿县
中沙群岛
长宁区
和林格尔县
尚志市
民和回族土族自治县
单县
古丈县
杭锦后旗
奉节县
召陵区
浪卡子县
楚雄县
岢岚县
礼县
陵川县
且末县
武穴市
招远市
秦都区
北安市
临淄区
大名县
昌都地区
太仓市
贵池县
秀英区
长岭县
古县
隆阳区
平安县
铁岭市
永清县
大理白族自治州
荷属安的列斯
开鲁县
通山县
夏县
赫山区
孝感市
儋县
苏仙区
新邵县
友好区
韶山区
扎兰屯市
大武口区
船山区
沙县
渭南县
平谷县
安达县
雨城区
来宾县
林口县
海港区
信宜市
湖里区
康县
历城县
清城区
洛宁县
青羊区
安提瓜
苍山县
虎亭区
楚雄市
库尔勒县
襄城县
新华区
蓬溪县
雅安市
唐山市
临澧县
昌平区
庐江县
赵县
马龙县
临汾县
宜章县
肇源县
青田县
埇桥区
富宁县
师河区
吴县市
南湖区
黄骅县
洛龙区
尼日利亚
运城县
天津市
沧源佤族自治县
南海市
栖霞县
渑池县
兴业县
恭城瑶族自治县
隆格尔县
官渡区
松北区
六枝特区
金水区
冀州市
长治县
圣马力诺
张店区
兴义县
大厂区
上蔡县
安康县
丰润县
凌云县
源城区
恩施市
武清县
兴化县
托克托县
海城县
肥城县
伊川县
英山县
巴彦淖尔市
汝州市
沅陵县
隆德县
琼山县
阳新县
开化县
皋兰县
新抚区
坡头区
迁安市
昭通市
武进县
乐平市
绵阳市
宁江区
延长县
石湾区
青原区
波兰
烈山区
内黄县
阿勒泰县
武安市
英吉沙县
殷都区
东港区
横山县
部队
隆安县
庆安县
芦溪区
磐石市
全州县
二道江区
托里县
西吉县
宣州区
法属圭亚那
秦安县
会泽县
鄄城县
绥德县
荔浦县
丰城市
赞比亚
柏乡县
大英县
贡嘎县
灌阳县
花都市
奎文区
巢湖地区
蒙城县
下城区
杏林区
亚东县
南和县
罗定县
姜堰市
汉中市
绿春县
武陵源区
德意志联邦共和国
平山区
神池县
牙买加
广宗县
衡水县
肥乡县
双滦区
海宁市
酉阳县
荆州区
五寨县
娄星区
宣威县
涟水县
耀州区
鞍山市
镇海区
徽县
德惠县
元江哈尼族彝族傣族自治县
静宁县
定安县
洪湖县
美姑县
吴桥县
葫芦岛市
阿克苏县
清丰县
高平市
石嘴山区
枝江市
珲春市
明溪县
五指山市
华安县
龙南县
安福县
碌曲县
和田地区
怀远县
广元县
沙湾区
运河区
额尔古纳市
南海区
安次区
象州县
惠水县
高州市
柳州市
乐昌市
罗平县
麻城市
茂名市
唐河县
宜黄县
北塘区
志丹县
维扬区
兴庆区
义县
泸西县
三台县
和静县
朝阳市
兴义市
八公山区
龙江县
邛崃市
盐田区
息烽县
宣汉县
德阳市
涿县
瑞士
安龙县
元阳县
普格县
屯留县
刚察县
宁陕县
榆阳区
东乌珠穆沁旗
沙市区
河西区
南昌县
德惠市
临清县
常德县
弋江区
霍县
鱼峰区
麟游县
克拉玛依区
三都水族自治县
叶城县
永嘉县
曲水县
东莞市
龙城区
贵县
嘉荫县
郯城县
郧西县
南区
湛江市
长泰县
天水市
郓城县
大祥区
西昌县
永宁县
鱼台县
呼伦贝尔市
沁阳市
新绛县
白玉县
浠水县
绍兴县
东安县
南关区
平舆县
双柏县
璧山县
锡山市
荣城县
韩城市
栾城县
仁化县
依安县
环县
基里巴斯
靖西县
吴忠市
许昌市
阿克塞哈萨克族自治县
崂山区
德化县
吴中区
宜春县
库克群岛
卢湾区
德格县
河东区
温州市
中牟县
庄河县
零陵区
津巴布韦
博茨瓦纳
平武县
焉耆回族自治县
奈曼旗
沅江市
红塔区
肇州县
正蓝旗
沙市市
黄陵县
江东区
汉川县
敦煌市
花都区
索县
常宁市
南丹县
集宁市
玉屏侗族自治县
摩纳哥
北道区
黑龙江省
芷江侗族自治县
矿区
江源县
辽中县
绥棱县
安丘市
瑞金县
小金县
灞桥区
增城县
金平区
长寿县
青龙满族自治县
吉木萨尔县
宜秀区
科尔沁左翼中旗
涪陵县
朔县
康乐县
濠江区
布特哈旗
清远市
武江区
蒙自县
大丰县
广宁县
吴起县
美属维尔京群岛
蕲春县
双桥区
湘乡县
湘阴县
昆都仑区
鲅鱼圈区
新龙县
安图县
西藏自治区
大同区
山丹县
宣城县
瓜州县
卢旺达
吉安县
陈巴尔虎旗
皮特凯恩岛
宏伟区
麻栗坡县
多米尼加共和国
玛多县
南安市
聂拉木县
余江县
芜湖县
宁安市
镇原县
凌源市
都昌县
米易县
康马县
滦平县
龙亭区
福安县
天等县
鄯善县
洮北区
长清县
广汉市
洛川县
南宁市
特克斯和凯特斯群岛
来凤县
皮山县
阆中县
云梦县
汤加
宝鸡市
达日县
峨边彝族自治县
摩洛哥
铜川市
定海区
义马市
瓦利斯和富图纳群岛
波阳县
犍为县
芮城县
交河县
沔阳县
双辽县
得荣县
贵港市港北区
安平县
铁山区
正阳县
南康县
晋城县
惠阳县
上杭县
顺德县
桐城县
吴堡县
苏丹
朝鲜
弥勒县
汾阳县
南郑县
滨海县
龙岗区
韩城县
徐汇区
袁州区
林周县
朝阳开发区
三水县
洪江市
剑川县
襄樊市郊区
铁岭县
建阳县
惠安县
陆丰市
龙里县
屯溪市
灵台县
巴西
蓬莱县
镇沅彝族哈尼族拉祜族自治县
中原区
任城区
红安县
卫滨区
江源区
泰安市
临江区
五河县
塘沽区
拱墅区
三元区
云台区
永兴县
榆树县
城关区
舞钢市
砚山县
大足县
甘肃省
襄城区
遂溪县
安顺市
钟祥市
菏泽县
江岸区
盂县
开县
荔城区
宣城地区
曲阜市
天门市
招远县
株洲市
原州区
上高县
荣成市
奎屯市
阿坝藏族羌族自治州
江山市
华宁县
月湖区
金昌市区
昌乐县
格林纳达
虹口区
曲靖县
隰县
尖山区
科摩罗
香洲区
南山区
虞城县
斯瓦巴德群岛
松岭区
渭滨区
五莲县
孟津县
绥芬河市
右江区
宿松县
凉城县
锦江区
嫩江县
所罗门群岛
拉萨市
五华区
宜都市
贵池市
东丰县
石炭井区
蕉岭县
洮安县
南安县
龙胜各族自治县
七里河区
邯山区
白城市
茶陵县
鲁山县
伽师县
桃江县
武昌区
渭南市
修文县
花山区
涟源市
寿光市
海门市
荥阳县
石渠县
修武县
樟树市
崇庆县
扶沟县
礼泉县
萝北县
圣卢西亚
邹县
闸北区
芒康县
遂昌县
徽州区
盖县
完县
茌平县
挪威
金平苗族瑶族傣族自治县
江永县
萍乡市
泰兴市
明水县
洞头县
道孚县
睢阳区
日照市
乌马河区
丹麦
日喀则市
泾川县
平原县
万秀区
襄樊市樊城区
延寿县
白银市
和政县
巴基斯坦
嘉定区
晋源区
宁南县
浦东新区
枣阳市
卓资县
齐河县
双城市
尖草坪区
河北区
梁河县
新巴尔虎右旗
察哈尔右翼后旗
雅安县
青岛市
内蒙古自治区
安仁县
驻马店市
杂多县
绩溪县
北市区
邳县
孝义市
阳曲县
承德县
海东地区
平塘县
石台县
广灵县
碾子山区
吐鲁番县
九龙坡区
白朗县
龙陵县
莱芜市
浙常山县
内达拉特旗
汉寿县
阿城市
鹤壁市
魏都区
益阳市
郑州市
扬中市
曲阜县
高碑店市
波多黎各
鄂托克旗
万载县
保加利亚
盘锦市
潮阳县
洛江区
上犹县
岐山县
衡东县
潍城区
巩义市
临渭区
内江县
铜仁市
南丰县
大石桥市
加查县
丹徒区
梅江区
香坊区
合浦县
望花区
平远县
西盟佤族自治县
居巢区
江南区
阳东县
福鼎市
黄石市
眉山市
忻城县
澳门特别行政区
比如县
资兴县
乌拉特中旗
新郑县
佛得角
太康县
东宝区
陇川县
瑙鲁
吉水县
金海区
雅江县
范县
宁蒗彝族自治县
临江市
屏山县
大庆市
鄂州市
普宁县
吴旗县
金坛市
五峰土家族自治县
和顺县
雨湖区
巴南区
南京市
乌海市
巴彦县
江宁县
麻江县
威克岛
广陵区
简阳市
涵江区
廉江市
清原满族自治县
江泰州市
武城县
香港特别行政区
海南藏族自治州
响水县
榆次区
宁县
千山区
眉县
七星区
定襄县
漾濞彝族自治县
蒙特塞拉特
天峻县
北镇满族自治县
五华县
上林县
西湖区
灵丘县
新兴县
临海市
苏里南
铜山区
信丰县
阿富汗
斗门县
西宁郊区
布维岛
福清县
淮阳县
安徽省
海地
郎溪县
泰来县
博湖县
吐鲁番市
红原县
保靖县
丰台区
涪城区
东川市市辖区
鼓楼区
平昌县
旺苍县
布隆迪
仁和区
沁阳县
港南区
资阳区
信阳县
山阳区
通榆县
涿州市
剑河县
天山区
临川区
巢湖市
武侯区
仁寿县
泾阳县
泰县
福泉市
涧西区
泸州市
鹿泉市
菏泽市
武平县
江宁区
昌平县
安西县
黑河市
崇信县
头屯河区
南川区
洪洞县
塞舌尔
省理县
琼山区
鹤岗市
武进市
平湖市
莆田市
万县
淮阴县
岚县
成华区
临潼区
五大连池市
仪陇县
杜尔伯特蒙古族自治县
木里藏族自治县
两当县
广水市
化隆回族自治县
民勤县
上思县
克拉玛依市
龙井市
噶尔县
商都县
武宁县
江洲区
海城区
南岸区
阿克苏市
岱山县
安道尔
石城县
新沂市
赛罕区
均县
临沂县
蒲圻市
曲江区
广安县
内科尔沁右翼中旗
菲律宾
江安县
毛德地
青云谱区
澄迈县
类乌齐县
江城哈尼族彝族自治县
青神县
新兴区
如皋县
钟祥县
错那县
同仁县
柬埔寨
临夏回族自治州
泉港区
黔江土家族苗族自治县
章丘市
巴青县
荷兰
珲春县
英国
商洛市
宁晋县
东方黎族自治县
阜阳市
峨山彝族自治县
毕节市
淳化县
海珠区
番禺县
日土县
梁园区
北流市
清水河县
无极县
桥西区
束鹿县
河口区
梓潼县
宜城市
井研县
淄川区
襄阳县
德江县
萨尔图区
乌兰县
贝宁
长阳土家族自治县
大竹县
江陵县
金阊区
九江县
开封市
定海县
龙口市
姚安县
岫岩满族自治县
新会区
古冶区
天桥区
安平区
曲靖市
西充县
永春县
奉贤区
东平县
望江县
潞西县
宜昌县
越西县
岳阳市
云溪区
中江县
马尾区
文峰区
白河县
拜城县
淮阴区
开江县
茂南区
紫金县
林芝县
南阳市
琼结县
个旧市
西沙群岛
元谋县
邛崃县
应山县
登封市
丰南市
北碚区
磐石县
晋城市
册亨县
城北区
科尔沁左翼后旗
丁青县
圣诞岛
几内亚比绍
抚顺县
鹤山市
水富县
忻府区
也门
鲁木齐市
多哥
连县
方法法
公安县
田东县
文莱
安泽县
那坡县
哥斯达黎加
尼日尔
宕昌县
鄞州区
郴县
资阳县
临县
遂宁市
南皮县
抚远县
爱辉县
泰州市
新芜区
西固区
建宁县
饶平县
青冈县
巴勒斯坦
长宁县
博白县
阿鲁科尔沁旗
兴安盟
云龙区
特立尼达和多哥巴
东蒂汶
呼伦贝尔盟
甘谷县
田家庵区
仲巴县
富顺县
婺城区
双流县
远安县
大新县
玄武区
汉台区
金塔县
