["2.清华大学计算机科学与技术系，北京100084；", "3.中国工程院，北京100088）摘要：在E级计算时代，超算系统一般使用多层存储架构以满足应用数据访问的容量和性能需求，这种架构中不同层次的存储介质差异较大，难以实现统一名字空间管理，往往需要应用修改数据访问流程才能最大程度利用到多层存储的性能和容量优势。", "针对多层存储统一名字空间的问题，提出针对非易失性双列存储模块（NVDIMM）的块级缓存和针对突发缓冲存储（BB）的文件级缓存技术。", "基于NVDIMM的块级缓存技术对缓存窗口灵活控制，以支持数据块粒度的异步读写，实现NVDIMM与BB层统一名字空间管理；", "基于BB的文件级缓存技术将数据缓存在BB层中，并动态迁移和管理文件副本，实现BB层与传统磁盘文件系统统一名字空间管理。", "在神威E级原型验证系统中的测试结果表明，所提出的两种技术较好地解决了多层存储的透明加速难题，NVDIMM块级缓存与BB相比，在缓存窗口16MB时128KB顺序读写带宽分别提升27%和36%，8KB随机读写带宽分别提升20%和37%；", "基于BB的文件缓存技术利用BB的高带宽支撑数据访问，与全局文件系统相比，128KB顺序读写带宽分别提升55%和141%，8KB随机读写带宽分别提升163%和209%。", "此外，实际应用的测试也表明以上两种缓存技术具有透明的存储加速效果。", "非易失性双列存储模块；", "高洁，助理研究员、硕士；", "陈起，助理研究员、博士研究生；", "陈左宁，中国工程院院士、研究员。", "为此，主流高性能计算系统均构建了多层存储体系，主要包括全局文件BurstBuffer以及计算节点本地高速NVDIMM等层次［6-7，18-19］，其架构如图1所示。", "系统（GlobalFileSystem，GFS）、突发缓冲存储（BurstBuffer，BB）［4］、节点高速存储层等，其中GFS主要使用大容量磁盘构建，BB一般使用NVMeSSD构建。", "最新发布的美国Frontier超算部署了三层存储［6］，包括计算节点本地高速存储、全局共享的SSD存储和全局共享的磁盘存储，合计存储容量高达760PB，数据读带宽达75TB/s，数据写带宽达35TB/s；", "日本超级计算机富岳［7］部署了两层存储，包括计算节点共享的SSD存储系统，容量达16PB，带宽达10TB/s，此外还基于磁盘构建了容量达100PB的全局文件系统。", "存储层次的不断增加，虽然提升了存储系统的总体性能，但是目前多层存储系统的构建缺乏统一标准，特别是BB层与计算节点本地存储层，为了发挥硬件介质的性能优势，其软件设计与传统存储软件存在显著差异，无法与传统文件系统形成统一名字空间，如GekkoFS［8］、UnifyFS［9］、CROSS［10］、Datawarp［11］、BeeOND［12-13］等文件系统均基于BB构建了独立的文件系统空间，需要应用修改数据访问路径，往往会导致额外的数据管理负担。", "正是由于以上原因，导致存储加速系统的利用率普遍不高［14］。", "而高性能BB存储系统一般基于SSD构建，性能相比全局文件系统更高，具备一定的数据共享机制，但是目前这一类系统往往不能完整支持POSIX接口，应用使用时不仅需要修改路径，而且还需要定制数据从GFS导入至BB（stage-in）以及从BB导出至GFS（stage-out）的管理流程，如GekkoFS［8］、DAOS［22］、UnifyFS［9］、HadaFS［23］、Datawarp［11］等；", "计算节点本地的NVDIMM存储性能更接近内存，但是容量较小，仅可作为临时性局部存储空间，这类存储介质一般通过块接口使用［24-25］，难以适用于通用的I/O流程［26］。", "分层存储通过更多层次高速硬件的部署提升了为解决多层存储架构无法实现统一名字空间访问的问题，本文提出对应用透明的加速技术。", "针对计算节点NVDIMM等高速存储层设计透明的块级数据读写缓存机制，提出支持数据顺序读和跨步读的预读算法，实现NVDIMM层与BB层统一名字空间管理；", "针对BB层设计文件级的数据缓存机制，提出缓存副本的一致性管理方法，实现BB层与传统GFS层统一名字空间管理。", "最终，基于神威E级原型验证系统对这2种缓存技术进行测试。", "1相关工作当前，随着超算算力的高速增长，为支撑超算应用的数据访问需求，超算存储系统一般使用分层存存储系统的基础性能，然而却带来了统一名字空间的问题，如何对应用隐藏多层次存储系统的复杂性，透明提升应用数据访问的效率成为业界关注的难题［14，27］。", "Elevator提出了一种针对BurstBuffer的透明缓存机制，可实现BB与GFS的透明整合，但是这种机制只能运行在HDF5库内部，存在适应性问题［15］；", "Unistor在Elevator的基础上实现了对通用场景下BB的加速机制支持，但是无法支持NVDIMM存储环境［16］；", "IBM在Summit中分别提出了面向计算节点本地SSD的块和文件级缓存机制，但是仅支持透明的写缓存［28］；", "LPCC基于Lustre文件系统实现了BB与GFS的数据缓存［20］，但是其要求BB中的数据必须写回GFS以支持数据共享，数据共享效率较低；", "神威E级原型验证系统是我国面向E级超算关键技术挑战构建的验证平台［29］，配置了全局文件系统、BB存储系统，并且具备利用节点内存进行I/O加速的基础。", "该系统中的全局文件系统基于Lustre+LWFS构建，与神威·太湖之光全局存储相似［19］；", "BB存储系统基于全新研制的HadaFS构建，该系统实现了用户层、松耦合的文件访问语义。", "面向下一代超算的I/O挑战，本文针对NVDIMM的块访问和BB的文件访问优势分别提出不同的数据缓存机制，从而支持多层存储加速的统一名字空间，实现对应用透明的I/O加速。", "相关技术在神威E级原型验证系统中进行部署，为神威下一代超算存储系统的研发提供参考。", "基于NVDIMM的块级缓存以计算节点高速NVDIMM存储介质为基础，通过NVDIMM高速块访问协议实现对传统文件数据块的缓存；", "基于BB的文件级缓存通过文件级的动态数据迁移，解决BB层与全局文件系统无法实现名字空间统一的问题。", "NVDIMM块级缓存模块在NVDIMM介质中以文件为单位分别维护了读写两个先进先出（FIFO）队列，此外还包括数据一致性控制、数据异步写引擎和数据预读引擎等部分。", "应用进程产生的文件操作如读（read）、写（write）、刷新（flush）、获取状态（stat）等将按照时间顺序依次进入队列，并由数据一致性控制部件决定是否立即向上层应用返回成功。", "对于写操作，若NVDIMM中事先设定的缓存窗口没有溢出，则设置为异步操作，否则设置为同步操作。", "异步操作意味着该写请求的数据块将被缓存至NVDIMM，同时客户端将立即向应用返回写成功，而同步操作意味着客户端需要等待该请求刷新至BB层文件系统后才能向应用返回结果。", "写操作缓存的数据块由数据异步写引擎负责刷新至BB层文件系统中。", "对于读操作，系统将尽可能多地预读数据块并缓存在读数据队列中，以减少从服务端直接读数据的次数。", "数据读引擎根据读缓存队列中缓存的数据块大小和偏移位置决定预读数据起始位置和大小，目前有可探测顺序（Sequential）读和跨步（Stride）读两种模式，对于随机读默认按照顺序读的方式预图2面向下一代超算的透明存储加速技术架构取数据，数据预取块大小为事先设定的大数据块，以提升命中概率。", "数据预读算法如算法1所示。", "NVDIMM层块级缓存功能作为一个独立模块嵌入超算存储客户端内部，自动截获应用文件读写的数据块地址、大小等信息，并为存储客户端提供块级写数据缓存和数据预读功能。", "此外，为了保证缓存的利用率，缓存块搜索的过程也需要同步进行缓存块清理，以实现后续更多数据的预读。", "预读数据块的搜索和管理算法算法2输入已经预读的数据块（offset，size，buffer）组成的顺序列表list，以及应用的读请求rq（offset，size）输出命中返回hitbuf，以及剩余未命中部分的left_offset和left_size；", "所有目录操作均由GFS完成，而对文件数据访问，则提供写缓存和预加载两种策略。", "在写缓存策略中，应用产生的数据默认写入BB中，系统将在收到close操作后将数据由BB迁移至GFS；", "而在预加载策略中，文件将在首次读或者收到用户预加载命令后，将文件由GFS预加载至BB。", "图4以文件预加载为例子，说明了文件级透明缓存的流程。", "读写一致性模块对于请求队列中的数据一致性进行检查，发现对同一文件同时进行缓存写与预读的I/O行为后将对该文件强制禁用写缓存和预读功能。", "由于NVDIMM是一种非易失的存储介质，因此基于NVDIMM的块缓存机制理论上具备节点故障后恢复数据的能力，为此，读写一致性处理部件在数据写入的同时还保留了文件数据块缓存的日志，以在节点故障恢复后快速恢复数据，同时由于底层文件系统存储了文件的真实大小和访问时间，因此故障状态下应用可根据文件大小、访问时间等检索受影响的文件，以在应用层做出补救。", "对于读缓存，由于本身不涉及数据一致性问题，因此无需特殊处理。", "NVDIMM层块级缓存支持两种管理方式：一种是用户通过环境变量设置加速目录和缓存窗口大小，该模块自动为目录中文件读写的全流程进行BB与GFS之间的文件迁移完成后，同一个文件在GFS和BB中存在两个副本。", "对于写缓存策略，BB中的副本在迁移完成后数据将被删除或者设置为只读权限，而对于预加载策略，BB中的副本只有读权限，文件缓存管理利用一个K-V库监控存储副本信息，并由缓存文件的属性检查和更新模块监控管理BB中只读副本与GFS中副本的属性变化，一旦发现GFS中的数据被更改或者BB中副本的存储时间超过预设时间，则BB中的只读副本将被删除，从而减少文件副本占用的BB空间，具体原理如图5所示。", "另一种是应用通过标准的ioctl接口以文件为单位进行缓存的动态开关，实现对数据缓存更加精确的控制。", "神威E级原型验证系统的存储系统符合图1所示的超算存储架构，其中数据转发节点配置了双路服务器CPU，单节点网络带宽为200Gb/s，并部署了两块NVMeSSD（单块容量为3.2TB）以构建突发缓冲存储（BB）。", "全局存储方面利用Lustre构建了全局文件系统（GFS），利用LWFS实现了全局文件系统的数据转发。", "在本文的测试中，由于NVDIMM硬件针对国产处理器环境的适配仍在实验阶段，因此使用节点DRAM内存模拟NVDIMM构建块级缓存。", "3.2测试方法［33］在神威原型验证系本文使用IORBenchmark统中测试存储加速技术使用后的带宽变化情况。", "IOR测试进程运行在计算节点中，每个测试进程通过本文提出的加速技术读写独立的文件。", "测试在不修改应用程序数据访问路径的前提下进行，分别测试加速技术启用和不启用时的性能，以对比本文所提技术的透明加速效果。", "此外，还使用超算典型应用对本文提出的加速技术进行测试。", "3.3测试结果分析3.3.1计算节点NVDIMM块级缓存的测试NVDIMM块缓存机制运行在存储系统客户端，由于在高性能应用运行时，NVDIMM可能有SWAP空间、应用直接存储数据等多种其他用途，同时为了测试NVDIMM缓存机制在缓存溢出时的加速效果，选择16MB缓存窗口进行测试（单节点4进程运行时占据的内存为64MB，考虑常用的国产NVDIMM单根大小为16GB，占比为1/256），对比技术为未使用NVDIMM块缓存的BB文件系统HadaFS的常规读写机制，内存刷新和预读块大小为1MB，选择128KB块顺序读写和8KB块随机读写两种典型模式，128KB块顺序读写单进程数据量为1GB，8KB块随机读写单进程数据量为80MB，由于NVDIMM块缓存机制仅作用在客户端，因此测试中服务端固定为一个转发节点。", "缓存窗口大小为16MB时128KB顺序读写带宽的测试结果如图6所示。", "随着测试进程数的不断增加，块缓存机制实现了读写带宽的加速。", "对于写操作：当1、4、16进程时，块缓存模式写带宽增幅超过40%；", "当进程超过64个时，写带宽增幅逐渐降低；", "当1024个进程并发时，增幅为12%；", "不同进程规模下的平均增幅为36%。", "出现这种现象的主要原因在于块缓存机制启用后虽然数据写入本地缓存，但是由于缓存窗口大小的限制，并未实现完全的缓存命中。", "以64进程为例，写缓存命中率为89%，一旦写缓存未命中，则该请求必须等待缓存队列清空后才能向应用返回，因此影响了性能。", "此外，测试中计算了文件的close时间，由于写文件完成后的close操作需要刷新元数据等信息，因此耗时较长，也一定程度影响了写缓存的总体效果。", "对于读操作：由于数据预读的块大小为1MB，128KB块读写时缓存命中率最高为87.5%，命中率低于写操作，因此测试的不同进程规模下的平均增幅更小，为27%；", "随着进程数的不断增加，加速幅度降低的主要原因在于底层存储的性能已经达到峰值，因此每个计算节点端可见的缓存刷新或者预读的速率降低，从而导致缓存命中率降低。", "随着测试进程数的增加，8KB随机读写的带宽不断增加，相对HadaFS常规操作的性能增幅变化与128KB块大小顺序读写带宽增幅变化规律相似，在64进程规模下读写带宽分别提升19%和39%，不同进程规模下的平均增幅分别为20%和37%。", "虽然8KB随机场景下NVDIMM缓存机制难以准确预测出读请求的偏移量，但是由于缓存窗口相对于8KB块大小比例较高，因此提前读入的数据量大，一定程度上增加了缓存命中的概率，由此保证了读带宽相比未使用缓存机制有所提升。", "随着缓存窗口的不断增大，写缓存命中率不断提升，因此写带宽加速比也不断增加，一旦缓存窗口大小超过写入的数据总量，写缓存的命中率达到100%，写带宽达到峰值，1GB窗口下写带宽相比16MB提升达到10倍以上。", "随着缓存窗口、预读数据块大小的不断增加，读带宽也呈现增加趋势，但是增加幅度相对缓慢，这是由于预读数据块大小始终没有超过文件大小。", "固定测试的进程规模，单进程以8KB块随机读写80MB数据，在增加缓存窗口时呈现出完全相同的规律，且加速效果更加明显，此处不再赘述。", "3.3.2基于BB的文件级缓存测试基于BurstBuffer的文件级缓存机制运行在BB节点上，负责实现BB存储的HadaFS文件系统与底层全局文件系统（GFS）之间的数据统一管理和透明加速。", "测试使用IOR程序，分别测试128KB顺序读写和8KB随机读写两种模式，对比技术为使用磁盘构建的GFS。", "测试中关闭了计算节点NVDIMM缓存，测试程序运行在计算节点，分别测试1、16、256、1024、4096、8192进程规模，128KB块顺序读写测试每个进程读写数据量为1GB，8KB块随机读写测试每个进程读写数据量为80MB，服务端运行在8个转发节点，每个转发节点包含2个NVMeSSD，对比本文提出的BB级文件缓存功能打开和关闭（相当于使用底层GFS进行数据读写）时的聚合带宽变化，以测试加速效果。", "128KB块顺序读写性能如图9所示。", "随着进程规模的不断增加，GFS模式和BB文件级缓存模式均实现了性能增长，最终在8192进程规模下BB文件级缓存模式的读写带宽相比GFS提升90%和147%，不同测试规模读写带宽的平均增幅分别为55%和141%。", "BB文件级缓存机制使用后，由于BB文件级缓存空间达到51.2TB，远大于测试程序产生的数据量，确保了测试中读写数据均实现缓存命中，测试程序产生的文件全部通过SSD读写，因此，测试程序实际使用的带宽即为BB层HadaFS的峰值带宽。", "事实上，当前几乎所有主流超算在设计时，其BB层缓存空间基本都能满足应用突发数据的多次写入，可基本保证突发数据的缓存能通过BB层的要求，提升系统总体I/O性能。", "8192进程时8KB随机写带宽提升240%，随机读带宽提升220%，不同测试规模下读写带宽的平均增幅分别为163%和209%，主要原因在于BB基于SSD构建，其小块随机读写性能相对于基于磁盘构建的GFS更具优势。", "使用本文提出的块级数据缓存技术后，WRF写数据I/O带宽提升50%。", "H5bench是一种多个进程写同一个文件的经典程序，模拟了VPIC应用的I/O流程，需要进行大量数据的读写。", "使用基于BB的文件级缓存后，H5bench性能变化如图11所示。", "可以看出：使用BB文件级缓存后，H5bench的写性能相比GFS平均提升3.6倍，读性能提升1.3倍，这是由于H5bench是典型的多进程读写同一文件的应用场景，GFS在这种场景下由于需要维护严格数据一致性，因此性能开销较大；", "此外，BB文件缓存的H5bench最高写带宽为图9中BB峰值性能的一半，而读性能达到图9中BB所能实现的最高读带宽，原因在于H5bench是多个进程写同一个文件，在底层BB端也面临着多个进程写同一个文件的场景，因此性能不如每个进程写独立的文件，由于多个进程读同一个文件时NVMeSSD底层文件系统缓存作用明显，因此能实现较高读性能。", "本文针对这一问题提出基于NVDIMM的块级缓存和基于BurstBuffer的文件级缓存机制，并在神威E级原型验证系统中进行部署和测试。", "测试结果表明，本文提出的技术可以实现应用透明的存储加速。", "下一步将继续研究多层存储面向应用的资源协调与分配机制，实现多应用共享的存储加速资源动态管理。"]